; domain
(define (domain GROCERY)
	(:requirements :strips :typing)
	(:types item)
	(:predicates (on ?x - item ?y - item)
			(ontable ?x - item)
			(cleartop ?x - item)
			(clearleft ?x - item)
			(clearright ?x - item)
			(handempty)
			(holding ?x - item)
			(toleft ?x - item ?y - item)
			(toright ?x -  item ?y - item)
			)

	(:action pick-up
		:parameters (?x - item)
		:precondition (and (cleartop ?x) (handempty))
		:effect
		(and (not (ontable ?x))
		     (not (cleartop ?x))
		     (not (handempty))
		     (holding ?x)))

	(:action put-on
		:parameters (?x - item ?y - item)
		:precondition (and (cleartop ?y) (holding ?x))
		:effect
		(and (on ?x ?y)
			 (not (cleartop ?y))
			 (handempty)
			 (cleartop ?x)
			 (clearleft ?x)
			 (clearright ?x)
			 (not (holding ?x))))

	(:action put-left
		:parameters (?x - item ?y - item)
		:precondition (and (clearleft ?y) (holding ?x))
		:effect
		(and (toleft ?x ?y)
			 (not (clearleft ?y))
			 (handempty)
			 (clearleft ?x)
			 (not (clearright ?x))
			 (not (holding ?x))))

	(:action put-right
		:parameters (?x - item ?y - item)
		:precondition (and (clearright ?y) (holding ?x))
		:effect
		(and (toright ?x ?y)
			 (not (clearright ?y))
			 (handempty)
			 (clearright ?x)
			 (not (clearleft ?x))
			 (not (holding ?x))))

)

; problem
(define (problem PACKED-GROCERY)
(:domain GROCERY)
(:objects bleach nutella coke pepsi lipton - item)
(:init (ontable bleach) (ontable nutella) (ontable coke) (ontable pepsi) (ontable lipton)
		(cleartop bleach) (cleartop nutella) (cleartop coke) (cleartop pepsi) (cleartop lipton)
		(clearright bleach) (clearright nutella) (clearright coke) (clearright pepsi) (clearright lipton) (clearleft bleach) (clearleft nutella) (clearleft coke) (clearleft pepsi) (clearleft lipton) (handempty))
(:goal (and (on coke bleach) (on nutella coke) (toright lipton bleach) (toleft pepsi bleach) ))
)

; plan
1. (pick-up pepsi)
   deleted: (ontable pepsi) (cleartop pepsi) (handempty)
   added: (holding pepsi)
   goals met: 0 of 4
2. (put-left pepsi bleach)
   deleted: (clearleft bleach) (clearright pepsi) (holding pepsi)
   added: (toleft pepsi bleach) (handempty)
   goals met: 1 of 4
3. (pick-up lipton)
   deleted: (ontable lipton) (cleartop lipton) (handempty)
   added: (holding lipton)
   goals met: 1 of 4
4. (put-right lipton bleach)
   deleted: (clearright bleach) (clearleft lipton) (holding lipton)
   added: (toright lipton bleach) (handempty)
   goals met: 2 of 4
5. (pick-up coke)
   deleted: (ontable coke) (cleartop coke) (handempty)
   added: (holding coke)
   goals met: 2 of 4
6. (put-on coke bleach)
   deleted: (cleartop bleach) (holding coke)
   added: (on coke bleach) (handempty) (cleartop coke)
   goals met: 3 of 4
7. (pick-up nutella)
   deleted: (ontable nutella) (cleartop nutella) (handempty)
   added: (holding nutella)
   goals met: 3 of 4
8. (put-on nutella coke)
   deleted: (cleartop coke) (holding nutella)
   added: (on nutella coke) (handempty) (cleartop nutella)
   goals met: 4 of 4
